tutorials/incompressible/channelFoam/channel395/0.org/k
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottomWall      
    {
        type            fixedValue;
        value           uniform 0;
    }

    topWall         
    {
        type            fixedValue;
        value           uniform 0;
    }

    sides1          
    {
        type            cyclic;
    }

    sides2          
    {
        type            cyclic;
    }

    inout1          
    {
        type            cyclic;
    }

    inout2          
    {
        type            cyclic;
    }
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
